In [5]:
import pandas as pd
import numpy as np

In [2]:
names = ['John','Shawn','Max','Smith','Nick','Steve']
pd.Series(names)

0     John
1    Shawn
2      Max
3    Smith
4     Nick
5    Steve
dtype: object

In [4]:
pd.Series(names, index=['a','b','c','d','e','f'])

a     John
b    Shawn
c      Max
d    Smith
e     Nick
f    Steve
dtype: object

In [6]:
ages = np.random.randint(1,100,40)

In [7]:
age_series = pd.Series(ages)

In [9]:
age_series[0]

73

In [10]:
age_series[0:5]

0    73
1    45
2    24
3     7
4    65
dtype: int32

In [11]:
# return first 5 observations
age_series.head()

0    73
1    45
2    24
3     7
4    65
dtype: int32

In [12]:
age_series.head(4)

0    73
1    45
2    24
3     7
dtype: int32

In [14]:
# last 5 observations
age_series.tail()

35    43
36    34
37    85
38    26
39    28
dtype: int32

In [15]:
data = {
    "names" : names,
    "dept" : ["IT", "HR", "IT", "HR", "IT", "Admin"],
    "salary" : [56000,25000,70000,55000,45000,30000]
}

In [17]:
# pd.Series(data)

In [30]:
df = pd.DataFrame(data, index=['a','b','c','d','e','f'])

In [31]:
df

   names   dept  salary
a   John     IT   56000
b  Shawn     HR   25000
c    Max     IT   70000
d  Smith     HR   55000
e   Nick     IT   45000
f  Steve  Admin   30000

In [32]:
df.head(3)

   names dept  salary
a   John   IT   56000
b  Shawn   HR   25000
c    Max   IT   70000

In [33]:
df.tail(3)

   names   dept  salary
d  Smith     HR   55000
e   Nick     IT   45000
f  Steve  Admin   30000

In [34]:
df['names']

a     John
b    Shawn
c      Max
d    Smith
e     Nick
f    Steve
Name: names, dtype: object

In [35]:
df[['names', 'dept']]

   names   dept
a   John     IT
b  Shawn     HR
c    Max     IT
d  Smith     HR
e   Nick     IT
f  Steve  Admin

In [40]:
df.loc['a']

names      John
dept         IT
salary    56000
Name: a, dtype: object

In [41]:
df.loc['c']

names       Max
dept         IT
salary    70000
Name: c, dtype: object

In [38]:
df.iloc[0]

names      John
dept         IT
salary    56000
Name: a, dtype: object

In [39]:
df.iloc[2]

names       Max
dept         IT
salary    70000
Name: c, dtype: object

In [42]:
df.iloc[0:3]

   names dept  salary
a   John   IT   56000
b  Shawn   HR   25000
c    Max   IT   70000

In [43]:
# conditions/filters on data frame

In [44]:
df

   names   dept  salary
a   John     IT   56000
b  Shawn     HR   25000
c    Max     IT   70000
d  Smith     HR   55000
e   Nick     IT   45000
f  Steve  Admin   30000

In [45]:
df['dept'] == 'IT'

a     True
b    False
c     True
d    False
e     True
f    False
Name: dept, dtype: bool

In [46]:
df[df['dept'] == 'IT']

  names dept  salary
a  John   IT   56000
c   Max   IT   70000
e  Nick   IT   45000

In [47]:
df[df['salary'] >= 50000]

   names dept  salary
a   John   IT   56000
c    Max   IT   70000
d  Smith   HR   55000

In [48]:
df[(df['dept'] == 'IT') & (df['salary'] > 50000)]

  names dept  salary
a  John   IT   56000
c   Max   IT   70000